# ZoneHeatingAirTemperatureParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ZoneHeatingAirTemperatureParam Property
ParameterTypeId Class See Also
---
"Heating Air Temperature"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ZoneHeatingAirTemperatureParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ZoneHeatingAirTemperatureParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ZoneHeatingAirTemperatureParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace